In [1]:
# GOOGLE COLAB SETUP
# from google.colab import drive
# drive.mount('/content/drive')

This is the beginning of the notebook.

ADM4142-A Fundamentals of Data science

The goal of this notebook is to retrieve and stage the source datasets into the format used in the dimensional model for analysis.

This notebook generates the Date_dimension of the weather/tourism/economy data frame.

In [2]:
# import statements
import pandas as pd
from datetime import datetime, timedelta

In [3]:
# Placeholder for loading the dataset's date column
# In practice, replace the following line with code to load the dataset
# For example: dates_from_dataset = pd.read_csv("path_to_weather_dataset.csv")["date"]

#url_ottawa = "https://raw.githubusercontent.com/noobstang/NNtraining/master/Weather49Sets/weatherstats_ottawa_daily.csv"
url_ottawa = "https://raw.githubusercontent.com/noobstang/cscsi4142-project-datasets/master/data/weatherstats_ottawa_daily.csv"

# Load and Preprocess Data
url = url_ottawa
data = pd.read_csv(url)["date"]

data.head(5)

C:\Users\soonr\AppData\Local\Temp\ipykernel_2740\3372439021.py:10: DtypeWarning: Columns (46,49) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv(url)["date"]

0    2024-03-21
1    2024-03-20
2    2024-03-19
3    2024-03-18
4    2024-03-17
Name: date, dtype: object

In [4]:
# Create the DataFrame with date_iso
data = pd.to_datetime(data)
filtered_data = data[(data.dt.year >= 1990) & (data.dt.year <= 2023)]

df = pd.DataFrame(filtered_data, columns=['date'])
df = df.rename(columns={'date': 'date_iso'})

# Sort the DataFrame by the 'date_iso' column from oldest to newest
df = df.sort_values(by='date_iso')

# Set the 'Date_key' enumeration, starting from 1
df['Date_key'] = range(1, len(df) + 1)

# Reset the index if desired
df = df.reset_index(drop=True)

df.head()

    date_iso  Date_key
0 1990-01-01         1
1 1990-01-02         2
2 1990-01-03         3
3 1990-01-04         4
4 1990-01-05         5

In [5]:
# Populate the DataFrame
df['Date_key'] = df.index + 1
df['date_iso'] = df['date_iso'].dt.strftime('%Y-%m-%d')
df['date_yearmonth'] = df['date_iso'].str.slice(0, 7)
df['year'] = df['date_iso'].str.slice(0, 4).astype(int)
df['month'] = df['date_iso'].str.slice(5, 7).astype(int)
df['day'] = df['date_iso'].str.slice(8, 10).astype(int)
df['day_of_week'] = df['date_iso'].apply(lambda x: datetime.strptime(x, '%Y-%m-%d').strftime('%A'))

# Reorder the DataFrame to match the requested order
df = df[['Date_key', 'date_iso', 'date_yearmonth', 'year', 'month', 'day', 'day_of_week']]

Nothing special with this one. All the other attributes are derived from the retrieved dates from the weather dataset.

Date_key: integer numeration of all entries from oldest to latest <br>
date_iso: date in format 'yyyy-mm-dd'. Copy of 'date' rows <br>
date_yearmonth: date in format 'yyyy'mm". <br>
month: month of date <br>
day: day of date <br>
day_of_week: corresponding day of week. Calculated by %7 remainders of index <br>


Preview rows to check for correctness

In [6]:
df.head(25)

    Date_key    date_iso date_yearmonth  year  month  day day_of_week
0          1  1990-01-01        1990-01  1990      1    1      Monday
1          2  1990-01-02        1990-01  1990      1    2     Tuesday
2          3  1990-01-03        1990-01  1990      1    3   Wednesday
3          4  1990-01-04        1990-01  1990      1    4    Thursday
4          5  1990-01-05        1990-01  1990      1    5      Friday
5          6  1990-01-06        1990-01  1990      1    6    Saturday
6          7  1990-01-07        1990-01  1990      1    7      Sunday
7          8  1990-01-08        1990-01  1990      1    8      Monday
8          9  1990-01-09        1990-01  1990      1    9     Tuesday
9         10  1990-01-10        1990-01  1990      1   10   Wednesday
10        11  1990-01-11        1990-01  1990      1   11    Thursday
11        12  1990-01-12        1990-01  1990      1   12      Friday
12        13  1990-01-13        1990-01  1990      1   13    Saturday
13        14  1990-01-14        1990-01  1990      1   14      Sunday
14        15  1990-01-15        1990-01  1990      1   15      Monday
15        16  1990-01-16        1990-01  1990      1   16     Tuesday
16        17  1990-01-17        1990-01  1990      1   17   Wednesday
17        18  1990-01-18        1990-01  1990      1   18    Thursday
18        19  1990-01-19        1990-01  1990      1   19      Friday
19        20  1990-01-20        1990-01  1990      1   20    Saturday
20        21  1990-01-21        1990-01  1990      1   21      Sunday
21        22  1990-01-22        1990-01  1990      1   22      Monday
22        23  1990-01-23        1990-01  1990      1   23     Tuesday
23        24  1990-01-24        1990-01  1990      1   24   Wednesday
24        25  1990-01-25        1990-01  1990      1   25    Thursday

In [7]:
# Preview the beginning of the DataFrame
df.tail()

       Date_key    date_iso date_yearmonth  year  month  day day_of_week
12413     12414  2023-12-27        2023-12  2023     12   27   Wednesday
12414     12415  2023-12-28        2023-12  2023     12   28    Thursday
12415     12416  2023-12-29        2023-12  2023     12   29      Friday
12416     12417  2023-12-30        2023-12  2023     12   30    Saturday
12417     12418  2023-12-31        2023-12  2023     12   31      Sunday

Run the following to save the transformed dataframe into a .csv file.

In [8]:
# Export the DataFrame to CSV
#df.to_csv('date.csv', index=False)



---

**Date_dimension option 2**
The following data frame derived includes only the year and month information.

In [9]:
import pandas as pd
from datetime import datetime, timedelta

In [10]:
# Simulated loading and preparation of the original DataFrame from the previous task

# Create the DataFrame with date_iso
data = pd.to_datetime(data)
filtered_data = data[(data.dt.year >= 1990) & (data.dt.year <= 2023)]

df2 = pd.DataFrame(filtered_data, columns=['date'])
df2 = df.rename(columns={'date': 'date_iso'})

#df.head()

In [11]:
start_date = datetime(1990, 1, 1)
end_date = datetime(2024, 3, 1)
date_range = pd.date_range(start=start_date, end=end_date)
df2 = pd.DataFrame(date_range, columns=['date_iso'])
df2['Date_key'] = df2.index + 1
df2['date_iso'] = df2['date_iso'].dt.strftime('%Y-%m-%d')
df2['date_yearmonth'] = df2['date_iso'].str.slice(0, 7)
df2['year'] = df2['date_iso'].str.slice(0, 4).astype(int)
df2['month'] = df2['date_iso'].str.slice(5, 7).astype(int)
df2['day'] = df2['date_iso'].str.slice(8, 10).astype(int)
df2['day_of_week'] = df2['date_iso'].apply(lambda x: datetime.strptime(x, '%Y-%m-%d').strftime('%A'))
df2 = df2[['Date_key', 'date_iso', 'date_yearmonth', 'year', 'month', 'day', 'day_of_week']]

In [12]:
df_ym = df2[['date_yearmonth', 'year', 'month']].drop_duplicates().reset_index(drop=True)
df_ym['Date_ym_key'] = df_ym.index + 1
df_ym = df_ym[['Date_ym_key', 'date_yearmonth', 'year', 'month']]

preview

In [13]:
# Preview the DataFrame
df_ym.head()

   Date_ym_key date_yearmonth  year  month
0            1        1990-01  1990      1
1            2        1990-02  1990      2
2            3        1990-03  1990      3
3            4        1990-04  1990      4
4            5        1990-05  1990      5

In [14]:
df_ym.tail()

     Date_ym_key date_yearmonth  year  month
406          407        2023-11  2023     11
407          408        2023-12  2023     12
408          409        2024-01  2024      1
409          410        2024-02  2024      2
410          411        2024-03  2024      3

export to csv

In [15]:
# Export the DataFrame to a CSV file
#df_ym.to_csv('date_yearmonth.csv', index=False)